yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l162r8.h
#define PWR_CSR1_PVDE            PWR_CSR1_bit.PVDE
#define PWR_CSR1_PLS             PWR_CSR1_bit.PLS
#define PWR_CSR1_PVDIEN          PWR_CSR1_bit.PVDIEN
#define PWR_CSR1_PVDIF           PWR_CSR1_bit.PVDIF
#define PWR_CSR1_PVDOF           PWR_CSR1_bit.PVDOF

#define PWR_CSR2_VREFINTF        PWR_CSR2_bit.VREFINTF
#define PWR_CSR2_ULP             PWR_CSR2_bit.ULP
#define PWR_CSR2_FWU             PWR_CSR2_bit.FWU

#endif

/*-------------------------------------------------------------------------
 *      PWR bit masks
 *-----------------------------------------------------------------------*/
#define MASK_PWR_CSR1_PVDE       0x01
#define MASK_PWR_CSR1_PLS        0x0E
#define MASK_PWR_CSR1_PVDIEN     0x10
#define MASK_PWR_CSR1_PVDIF      0x20
#define MASK_PWR_CSR1_PVDOF      0x40

#define MASK_PWR_CSR2_VREFINTF   0x01
#define MASK_PWR_CSR2_ULP        0x02
#define MASK_PWR_CSR2_FWU        0x04


/*-------------------------------------------------------------------------
 *      CLK register definitions
 *-----------------------------------------------------------------------*/
/* Clock master divider register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CKM         : 3;
} __BITS_CLK_CKDIVR;
#endif
__IO_REG8_BIT(CLK_CKDIVR,  0x50C0, __READ_WRITE, __BITS_CLK_CKDIVR);

/* Clock RTC register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RTCSWBSY    : 1;
  unsigned char RTCSEL0     : 1;
  unsigned char RTCSEL1     : 1;
  unsigned char RTCSEL2     : 1;
  unsigned char RTCSEL3     : 1;
  unsigned char RTCDIV0     : 1;
  unsigned char RTCDIV1     : 1;
  unsigned char RTCDIV2     : 1;
} __BITS_CLK_CRTCR;
#endif
__IO_REG8_BIT(CLK_CRTCR,   0x50C1, __READ_WRITE, __BITS_CLK_CRTCR);

/* Internal clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HSION       : 1;
  unsigned char HSIRDY      : 1;
  unsigned char LSION       : 1;
  unsigned char LSIRDY      : 1;
  unsigned char SAHALT      : 1;
  unsigned char FHWU        : 1;
  unsigned char BEEPAHALT   : 1;
} __BITS_CLK_ICKCR;
#endif
__IO_REG8_BIT(CLK_ICKCR,   0x50C2, __READ_WRITE, __BITS_CLK_ICKCR);

/* Peripheral clock gating register 1 */
__IO_REG8    (CLK_PCKENR1, 0x50C3, __READ_WRITE);
/* Peripheral clock gating register 2 */
__IO_REG8    (CLK_PCKENR2, 0x50C4, __READ_WRITE);
/* Configurable clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCOSWBSY    : 1;
  unsigned char CCOSEL      : 4;
  unsigned char CCODIV      : 3;
} __BITS_CLK_CCOR;
#endif
__IO_REG8_BIT(CLK_CCOR,    0x50C5, __READ_WRITE, __BITS_CLK_CCOR);

/* External clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HSEON       : 1;
  unsigned char HSERDY      : 1;
  unsigned char LSEON       : 1;
  unsigned char LSERDY      : 1;
  unsigned char HSEBYP      : 1;
  unsigned char LSEBYP      : 1;
} __BITS_CLK_ECKCR;
#endif
__IO_REG8_BIT(CLK_ECKCR,   0x50C6, __READ_WRITE, __BITS_CLK_ECKCR);

/* System clock status register */
__IO_REG8    (CLK_SCSR,    0x50C7, __READ_WRITE);
/* System clock switch register */
__IO_REG8    (CLK_SWR,     0x50C8, __READ_WRITE);
/* Clock switch control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWBSY       : 1;
  unsigned char SWEN        : 1;
  unsigned char SWIEN       : 1;
  unsigned char SWIF        : 1;
} __BITS_CLK_SWCR;
#endif
__IO_REG8_BIT(CLK_SWCR,    0x50C9, __READ_WRITE, __BITS_CLK_SWCR);

/* Clock security system register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CSSEN       : 1;
  unsigned char AUX         : 1;
  unsigned char CSSDIE      : 1;
  unsigned char CSSD        : 1;
  unsigned char CSSDGON     : 1;
} __BITS_CLK_CSSR;
#endif
__IO_REG8_BIT(CLK_CSSR,    0x50CA, __READ_WRITE, __BITS_CLK_CSSR);

/* Clock BEEP register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char BEEPSWBSY   : 1;
  unsigned char CLKBEEPSEL0 : 1;
  unsigned char CLKBEEPSEL1 : 1;
} __BITS_CLK_CBEEPR;
#endif
__IO_REG8_BIT(CLK_CBEEPR,  0x50CB, __READ_WRITE, __BITS_CLK_CBEEPR);

/* HSI calibration register */
__IO_REG8    (CLK_HSICALR, 0x50CC, __READ);
/* HSI clock calibration trimming register */
__IO_REG8    (CLK_HSITRIMR, 0x50CD, __READ_WRITE);
/* HSI unlock register */
__IO_REG8    (CLK_HSIUNLCKR, 0x50CE, __READ_WRITE);
/* Main regulator control status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char REGREADY    : 1;
  unsigned char REGOFF      : 1;
  unsigned char HSIPD       : 1;
  unsigned char LSIPD       : 1;
  unsigned char HSEPD       : 1;
  unsigned char LSEPD       : 1;
  unsigned char EEBUSY      : 1;
  unsigned char EEREADY     : 1;
} __BITS_CLK_REGCSR;
#endif
__IO_REG8_BIT(CLK_REGCSR,  0x50CF, __READ_WRITE, __BITS_CLK_REGCSR);

/* Peripheral clock gating register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PCKEN30     : 1;
  unsigned char PCKEN31     : 1;
  unsigned char PCKEN32     : 1;
  unsigned char PCKEN33     : 1;
  unsigned char PCKEN34     : 1;
  unsigned char PCKEN35     : 1;
} __BITS_CLK_PCKENR3;
#endif
__IO_REG8_BIT(CLK_PCKENR3, 0x50D0, __READ_WRITE, __BITS_CLK_PCKENR3);


/*-------------------------------------------------------------------------
 *      CLK bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define CLK_CKDIVR_CKM           CLK_CKDIVR_bit.CKM

#define CLK_CRTCR_RTCSWBSY       CLK_CRTCR_bit.RTCSWBSY
#define CLK_CRTCR_RTCSEL0        CLK_CRTCR_bit.RTCSEL0
#define CLK_CRTCR_RTCSEL1        CLK_CRTCR_bit.RTCSEL1
#define CLK_CRTCR_RTCSEL2        CLK_CRTCR_bit.RTCSEL2
#define CLK_CRTCR_RTCSEL3        CLK_CRTCR_bit.RTCSEL3
#define CLK_CRTCR_RTCDIV0        CLK_CRTCR_bit.RTCDIV0
#define CLK_CRTCR_RTCDIV1        CLK_CRTCR_bit.RTCDIV1
#define CLK_CRTCR_RTCDIV2        CLK_CRTCR_bit.RTCDIV2

#define CLK_ICKCR_HSION          CLK_ICKCR_bit.HSION
#define CLK_ICKCR_HSIRDY         CLK_ICKCR_bit.HSIRDY
#define CLK_ICKCR_LSION          CLK_ICKCR_bit.LSION
#define CLK_ICKCR_LSIRDY         CLK_ICKCR_bit.LSIRDY
#define CLK_ICKCR_SAHALT         CLK_ICKCR_bit.SAHALT
#define CLK_ICKCR_FHWU           CLK_ICKCR_bit.FHWU
#define CLK_ICKCR_BEEPAHALT      CLK_ICKCR_bit.BEEPAHALT

#define CLK_CCOR_CCOSWBSY        CLK_CCOR_bit.CCOSWBSY
#define CLK_CCOR_CCOSEL          CLK_CCOR_bit.CCOSEL
#define CLK_CCOR_CCODIV          CLK_CCOR_bit.CCODIV

#define CLK_ECKCR_HSEON          CLK_ECKCR_bit.HSEON
#define CLK_ECKCR_HSERDY         CLK_ECKCR_bit.HSERDY
#define CLK_ECKCR_LSEON          CLK_ECKCR_bit.LSEON
#define CLK_ECKCR_LSERDY         CLK_ECKCR_bit.LSERDY
#define CLK_ECKCR_HSEBYP         CLK_ECKCR_bit.HSEBYP
#define CLK_ECKCR_LSEBYP         CLK_ECKCR_bit.LSEBYP

#define CLK_SWCR_SWBSY           CLK_SWCR_bit.SWBSY
#define CLK_SWCR_SWEN            CLK_SWCR_bit.SWEN
#define CLK_SWCR_SWIEN           CLK_SWCR_bit.SWIEN
#define CLK_SWCR_SWIF            CLK_SWCR_bit.SWIF

#define CLK_CSSR_CSSEN           CLK_CSSR_bit.CSSEN
#define CLK_CSSR_AUX             CLK_CSSR_bit.AUX
#define CLK_CSSR_CSSDIE          CLK_CSSR_bit.CSSDIE
#define CLK_CSSR_CSSD            CLK_CSSR_bit.CSSD
#define CLK_CSSR_CSSDGON         CLK_CSSR_bit.CSSDGON

#define CLK_CBEEPR_BEEPSWBSY     CLK_CBEEPR_bit.BEEPSWBSY
#define CLK_CBEEPR_CLKBEEPSEL0   CLK_CBEEPR_bit.CLKBEEPSEL0
#define CLK_CBEEPR_CLKBEEPSEL1   CLK_CBEEPR_bit.CLKBEEPSEL1

#define CLK_REGCSR_REGREADY      CLK_REGCSR_bit.REGREADY
#define CLK_REGCSR_REGOFF        CLK_REGCSR_bit.REGOFF
#define CLK_REGCSR_HSIPD         CLK_REGCSR_bit.HSIPD
#define CLK_REGCSR_LSIPD         CLK_REGCSR_bit.LSIPD
#define CLK_REGCSR_HSEPD         CLK_REGCSR_bit.HSEPD
#define CLK_REGCSR_LSEPD         CLK_REGCSR_bit.LSEPD
#define CLK_REGCSR_EEBUSY        CLK_REGCSR_bit.EEBUSY
#define CLK_REGCSR_EEREADY       CLK_REGCSR_bit.EEREADY

#define CLK_PCKENR3_PCKEN30      CLK_PCKENR3_bit.PCKEN30
#define CLK_PCKENR3_PCKEN31      CLK_PCKENR3_bit.PCKEN31
#define CLK_PCKENR3_PCKEN32      CLK_PCKENR3_bit.PCKEN32
#define CLK_PCKENR3_PCKEN33      CLK_PCKENR3_bit.PCKEN33
#define CLK_PCKENR3_PCKEN34      CLK_PCKENR3_bit.PCKEN34
#define CLK_PCKENR3_PCKEN35      CLK_PCKENR3_bit.PCKEN35

#endif

/*-------------------------------------------------------------------------
 *      CLK bit masks
 *-----------------------------------------------------------------------*/
#define MASK_CLK_CKDIVR_CKM      0x07

#define MASK_CLK_CRTCR_RTCSWBSY  0x01
#define MASK_CLK_CRTCR_RTCSEL0   0x02
#define MASK_CLK_CRTCR_RTCSEL1   0x04
#define MASK_CLK_CRTCR_RTCSEL2   0x08
#define MASK_CLK_CRTCR_RTCSEL3   0x10
#define MASK_CLK_CRTCR_RTCDIV0   0x20
#define MASK_CLK_CRTCR_RTCDIV1   0x40
#define MASK_CLK_CRTCR_RTCDIV2   0x80

#define MASK_CLK_ICKCR_HSION     0x01
#define MASK_CLK_ICKCR_HSIRDY    0x02
#define MASK_CLK_ICKCR_LSION     0x04
#define MASK_CLK_ICKCR_LSIRDY    0x08
#define MASK_CLK_ICKCR_SAHALT    0x10
#define MASK_CLK_ICKCR_FHWU      0x20
#define MASK_CLK_ICKCR_BEEPAHALT 0x40

#define MASK_CLK_CCOR_CCOSWBSY   0x01
#define MASK_CLK_CCOR_CCOSEL     0x1E
#define MASK_CLK_CCOR_CCODIV     0xE0

#define MASK_CLK_ECKCR_HSEON     0x01
#define MASK_CLK_ECKCR_HSERDY    0x02
#define MASK_CLK_ECKCR_LSEON     0x04
#define MASK_CLK_ECKCR_LSERDY    0x08
#define MASK_CLK_ECKCR_HSEBYP    0x10
#define MASK_CLK_ECKCR_LSEBYP    0x20

