yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l162r8.h
#define USART3_BRR2_USART_DIV0   USART3_BRR2_bit.USART_DIV0
#define USART3_BRR2_USART_DIV1   USART3_BRR2_bit.USART_DIV1
#define USART3_BRR2_USART_DIV2   USART3_BRR2_bit.USART_DIV2
#define USART3_BRR2_USART_DIV3   USART3_BRR2_bit.USART_DIV3
#define USART3_BRR2_USART_DIV12  USART3_BRR2_bit.USART_DIV12
#define USART3_BRR2_USART_DIV13  USART3_BRR2_bit.USART_DIV13
#define USART3_BRR2_USART_DIV14  USART3_BRR2_bit.USART_DIV14
#define USART3_BRR2_USART_DIV15  USART3_BRR2_bit.USART_DIV15

#define USART3_CR1_PIEN          USART3_CR1_bit.PIEN
#define USART3_CR1_PS            USART3_CR1_bit.PS
#define USART3_CR1_PCEN          USART3_CR1_bit.PCEN
#define USART3_CR1_WAKE          USART3_CR1_bit.WAKE
#define USART3_CR1_M             USART3_CR1_bit.M
#define USART3_CR1_USARTD        USART3_CR1_bit.USARTD
#define USART3_CR1_T8            USART3_CR1_bit.T8
#define USART3_CR1_R8            USART3_CR1_bit.R8

#define USART3_CR2_SBK           USART3_CR2_bit.SBK
#define USART3_CR2_RWU           USART3_CR2_bit.RWU
#define USART3_CR2_REN           USART3_CR2_bit.REN
#define USART3_CR2_TEN           USART3_CR2_bit.TEN
#define USART3_CR2_ILIEN         USART3_CR2_bit.ILIEN
#define USART3_CR2_RIEN          USART3_CR2_bit.RIEN
#define USART3_CR2_TCIEN         USART3_CR2_bit.TCIEN
#define USART3_CR2_TIEN          USART3_CR2_bit.TIEN

#define USART3_CR3_LBCL          USART3_CR3_bit.LBCL
#define USART3_CR3_CPHA          USART3_CR3_bit.CPHA
#define USART3_CR3_CPOL          USART3_CR3_bit.CPOL
#define USART3_CR3_CLKEN         USART3_CR3_bit.CLKEN
#define USART3_CR3_STOP          USART3_CR3_bit.STOP

#define USART3_CR4_ADD           USART3_CR4_bit.ADD

#define USART3_CR5_EIE           USART3_CR5_bit.EIE
#define USART3_CR5_IREN          USART3_CR5_bit.IREN
#define USART3_CR5_IRLP          USART3_CR5_bit.IRLP
#define USART3_CR5_HDSEL         USART3_CR5_bit.HDSEL
#define USART3_CR5_NACK          USART3_CR5_bit.NACK
#define USART3_CR5_SCEN          USART3_CR5_bit.SCEN
#define USART3_CR5_DMAR          USART3_CR5_bit.DMAR
#define USART3_CR5_DMAT          USART3_CR5_bit.DMAT

#endif

/*-------------------------------------------------------------------------
 *      USART3 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_USART3_SR_PE        0x01
#define MASK_USART3_SR_FE        0x02
#define MASK_USART3_SR_NF        0x04
#define MASK_USART3_SR_OR        0x08
#define MASK_USART3_SR_IDLE      0x10
#define MASK_USART3_SR_RXNE      0x20
#define MASK_USART3_SR_TC        0x40
#define MASK_USART3_SR_TXE       0x80

#define MASK_USART3_BRR1_USART_DIV4 0x01
#define MASK_USART3_BRR1_USART_DIV5 0x02
#define MASK_USART3_BRR1_USART_DIV6 0x04
#define MASK_USART3_BRR1_USART_DIV7 0x08
#define MASK_USART3_BRR1_USART_DIV8 0x10
#define MASK_USART3_BRR1_USART_DIV9 0x20
#define MASK_USART3_BRR1_USART_DIV10 0x40
#define MASK_USART3_BRR1_USART_DIV11 0x80

#define MASK_USART3_BRR2_USART_DIV0 0x01
#define MASK_USART3_BRR2_USART_DIV1 0x02
#define MASK_USART3_BRR2_USART_DIV2 0x04
#define MASK_USART3_BRR2_USART_DIV3 0x08
#define MASK_USART3_BRR2_USART_DIV12 0x10
#define MASK_USART3_BRR2_USART_DIV13 0x20
#define MASK_USART3_BRR2_USART_DIV14 0x40
#define MASK_USART3_BRR2_USART_DIV15 0x80

#define MASK_USART3_CR1_PIEN     0x01
#define MASK_USART3_CR1_PS       0x02
#define MASK_USART3_CR1_PCEN     0x04
#define MASK_USART3_CR1_WAKE     0x08
#define MASK_USART3_CR1_M        0x10
#define MASK_USART3_CR1_USARTD   0x20
#define MASK_USART3_CR1_T8       0x40
#define MASK_USART3_CR1_R8       0x80

#define MASK_USART3_CR2_SBK      0x01
#define MASK_USART3_CR2_RWU      0x02
#define MASK_USART3_CR2_REN      0x04
#define MASK_USART3_CR2_TEN      0x08
#define MASK_USART3_CR2_ILIEN    0x10
#define MASK_USART3_CR2_RIEN     0x20
#define MASK_USART3_CR2_TCIEN    0x40
#define MASK_USART3_CR2_TIEN     0x80

#define MASK_USART3_CR3_LBCL     0x01
#define MASK_USART3_CR3_CPHA     0x02
#define MASK_USART3_CR3_CPOL     0x04
#define MASK_USART3_CR3_CLKEN    0x08
#define MASK_USART3_CR3_STOP     0x30

#define MASK_USART3_CR4_ADD      0x0F

#define MASK_USART3_CR5_EIE      0x01
#define MASK_USART3_CR5_IREN     0x02
#define MASK_USART3_CR5_IRLP     0x04
#define MASK_USART3_CR5_HDSEL    0x08
#define MASK_USART3_CR5_NACK     0x10
#define MASK_USART3_CR5_SCEN     0x20
#define MASK_USART3_CR5_DMAR     0x40
#define MASK_USART3_CR5_DMAT     0x80


/*-------------------------------------------------------------------------
 *      LCD register definitions
 *-----------------------------------------------------------------------*/
/* LCD control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char B2          : 1;
  unsigned char DUTY0       : 1;
  unsigned char DUTY1       : 1;
  unsigned char BLINKF0     : 1;
  unsigned char BLINKF1     : 1;
  unsigned char BLINKF2     : 1;
  unsigned char BLINK0      : 1;
  unsigned char BLINK1      : 1;
} __BITS_LCD_CR1;
#endif
__IO_REG8_BIT(LCD_CR1,     0x5400, __READ_WRITE, __BITS_LCD_CR1);

/* LCD control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VSEL        : 1;
  unsigned char CC0         : 1;
  unsigned char CC1         : 1;
  unsigned char CC2         : 1;
  unsigned char HD          : 1;
  unsigned char PON0        : 1;
  unsigned char PON1        : 1;
  unsigned char PON2        : 1;
} __BITS_LCD_CR2;
#endif
__IO_REG8_BIT(LCD_CR2,     0x5401, __READ_WRITE, __BITS_LCD_CR2);

/* LCD control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DEAD0       : 1;
  unsigned char DEAD1       : 1;
  unsigned char DEAD2       : 1;
  unsigned char SOFC        : 1;
  unsigned char SOF         : 1;
  unsigned char SOFIE       : 1;
  unsigned char LCDEN       : 1;
} __BITS_LCD_CR3;
#endif
__IO_REG8_BIT(LCD_CR3,     0x5402, __READ_WRITE, __BITS_LCD_CR3);

/* LCD frequency selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DIV0        : 1;
  unsigned char DIV1        : 1;
  unsigned char DIV2        : 1;
  unsigned char DIV3        : 1;
  unsigned char PS0         : 1;
  unsigned char PS1         : 1;
  unsigned char PS2         : 1;
  unsigned char PS3         : 1;
} __BITS_LCD_FRQ;
#endif
__IO_REG8_BIT(LCD_FRQ,     0x5403, __READ_WRITE, __BITS_LCD_FRQ);

/* LCD Port mask register 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG00       : 1;
  unsigned char SEG01       : 1;
  unsigned char SEG02       : 1;
  unsigned char SEG03       : 1;
  unsigned char SEG04       : 1;
  unsigned char SEG05       : 1;
  unsigned char SEG06       : 1;
  unsigned char SEG07       : 1;
} __BITS_LCD_PM0;
#endif
__IO_REG8_BIT(LCD_PM0,     0x5404, __READ_WRITE, __BITS_LCD_PM0);

