yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l162r8.h
#define LCD_RAM11_S304           LCD_RAM11_bit.S304
#define LCD_RAM11_S305           LCD_RAM11_bit.S305
#define LCD_RAM11_S306           LCD_RAM11_bit.S306
#define LCD_RAM11_S307           LCD_RAM11_bit.S307
#define LCD_RAM11_S308           LCD_RAM11_bit.S308
#define LCD_RAM11_S309           LCD_RAM11_bit.S309
#define LCD_RAM11_S310           LCD_RAM11_bit.S310
#define LCD_RAM11_S311           LCD_RAM11_bit.S311

#define LCD_RAM12_S312           LCD_RAM12_bit.S312
#define LCD_RAM12_S313           LCD_RAM12_bit.S313
#define LCD_RAM12_S314           LCD_RAM12_bit.S314
#define LCD_RAM12_S315           LCD_RAM12_bit.S315
#define LCD_RAM12_S316           LCD_RAM12_bit.S316
#define LCD_RAM12_S317           LCD_RAM12_bit.S317
#define LCD_RAM12_S318           LCD_RAM12_bit.S318
#define LCD_RAM12_S319           LCD_RAM12_bit.S319

#define LCD_RAM13_S320           LCD_RAM13_bit.S320
#define LCD_RAM13_S321           LCD_RAM13_bit.S321
#define LCD_RAM13_S322           LCD_RAM13_bit.S322
#define LCD_RAM13_S323           LCD_RAM13_bit.S323
#define LCD_RAM13_S324           LCD_RAM13_bit.S324
#define LCD_RAM13_S305           LCD_RAM13_bit.S305
#define LCD_RAM13_S306           LCD_RAM13_bit.S306
#define LCD_RAM13_S327           LCD_RAM13_bit.S327

#define LCD_RAM14_S028           LCD_RAM14_bit.S028
#define LCD_RAM14_S029           LCD_RAM14_bit.S029
#define LCD_RAM14_S030           LCD_RAM14_bit.S030
#define LCD_RAM14_S031           LCD_RAM14_bit.S031
#define LCD_RAM14_S032           LCD_RAM14_bit.S032
#define LCD_RAM14_S033           LCD_RAM14_bit.S033
#define LCD_RAM14_S034           LCD_RAM14_bit.S034
#define LCD_RAM14_S035           LCD_RAM14_bit.S035

#define LCD_RAM15_S036           LCD_RAM15_bit.S036
#define LCD_RAM15_S037           LCD_RAM15_bit.S037
#define LCD_RAM15_S038           LCD_RAM15_bit.S038
#define LCD_RAM15_S039           LCD_RAM15_bit.S039
#define LCD_RAM15_S040           LCD_RAM15_bit.S040
#define LCD_RAM15_S041           LCD_RAM15_bit.S041
#define LCD_RAM15_S042           LCD_RAM15_bit.S042
#define LCD_RAM15_S043           LCD_RAM15_bit.S043

#define LCD_RAM16_S128           LCD_RAM16_bit.S128
#define LCD_RAM16_S129           LCD_RAM16_bit.S129
#define LCD_RAM16_S130           LCD_RAM16_bit.S130
#define LCD_RAM16_S131           LCD_RAM16_bit.S131
#define LCD_RAM16_S132           LCD_RAM16_bit.S132
#define LCD_RAM16_S133           LCD_RAM16_bit.S133
#define LCD_RAM16_S134           LCD_RAM16_bit.S134
#define LCD_RAM16_S135           LCD_RAM16_bit.S135

#define LCD_RAM17_S136           LCD_RAM17_bit.S136
#define LCD_RAM17_S137           LCD_RAM17_bit.S137
#define LCD_RAM17_S138           LCD_RAM17_bit.S138
#define LCD_RAM17_S139           LCD_RAM17_bit.S139
#define LCD_RAM17_S140           LCD_RAM17_bit.S140
#define LCD_RAM17_S141           LCD_RAM17_bit.S141
#define LCD_RAM17_S142           LCD_RAM17_bit.S142
#define LCD_RAM17_S143           LCD_RAM17_bit.S143

#define LCD_RAM18_S228           LCD_RAM18_bit.S228
#define LCD_RAM18_S229           LCD_RAM18_bit.S229
#define LCD_RAM18_S230           LCD_RAM18_bit.S230
#define LCD_RAM18_S231           LCD_RAM18_bit.S231
#define LCD_RAM18_S232           LCD_RAM18_bit.S232
#define LCD_RAM18_S233           LCD_RAM18_bit.S233
#define LCD_RAM18_S234           LCD_RAM18_bit.S234
#define LCD_RAM18_S235           LCD_RAM18_bit.S235

#define LCD_RAM19_S236           LCD_RAM19_bit.S236
#define LCD_RAM19_S237           LCD_RAM19_bit.S237
#define LCD_RAM19_S238           LCD_RAM19_bit.S238
#define LCD_RAM19_S239           LCD_RAM19_bit.S239
#define LCD_RAM19_S240           LCD_RAM19_bit.S240
#define LCD_RAM19_S241           LCD_RAM19_bit.S241
#define LCD_RAM19_S242           LCD_RAM19_bit.S242
#define LCD_RAM19_S243           LCD_RAM19_bit.S243

#define LCD_RAM20_S328           LCD_RAM20_bit.S328
#define LCD_RAM20_S329           LCD_RAM20_bit.S329
#define LCD_RAM20_S330           LCD_RAM20_bit.S330
#define LCD_RAM20_S331           LCD_RAM20_bit.S331
#define LCD_RAM20_S332           LCD_RAM20_bit.S332
#define LCD_RAM20_S333           LCD_RAM20_bit.S333
#define LCD_RAM20_S334           LCD_RAM20_bit.S334
#define LCD_RAM20_S335           LCD_RAM20_bit.S335

#define LCD_RAM21_S336           LCD_RAM21_bit.S336
#define LCD_RAM21_S337           LCD_RAM21_bit.S337
#define LCD_RAM21_S338           LCD_RAM21_bit.S338
#define LCD_RAM21_S339           LCD_RAM21_bit.S339
#define LCD_RAM21_S340           LCD_RAM21_bit.S340
#define LCD_RAM21_S341           LCD_RAM21_bit.S341
#define LCD_RAM21_S342           LCD_RAM21_bit.S342
#define LCD_RAM21_S343           LCD_RAM21_bit.S343

#endif

/*-------------------------------------------------------------------------
 *      LCD bit masks
 *-----------------------------------------------------------------------*/
#define MASK_LCD_CR1_B2          0x01
#define MASK_LCD_CR1_DUTY0       0x02
#define MASK_LCD_CR1_DUTY1       0x04
#define MASK_LCD_CR1_BLINKF0     0x08
#define MASK_LCD_CR1_BLINKF1     0x10
#define MASK_LCD_CR1_BLINKF2     0x20
#define MASK_LCD_CR1_BLINK0      0x40
#define MASK_LCD_CR1_BLINK1      0x80

#define MASK_LCD_CR2_VSEL        0x01
#define MASK_LCD_CR2_CC0         0x02
#define MASK_LCD_CR2_CC1         0x04
#define MASK_LCD_CR2_CC2         0x08
#define MASK_LCD_CR2_HD          0x10
#define MASK_LCD_CR2_PON0        0x20
#define MASK_LCD_CR2_PON1        0x40
#define MASK_LCD_CR2_PON2        0x80

#define MASK_LCD_CR3_DEAD0       0x01
#define MASK_LCD_CR3_DEAD1       0x02
#define MASK_LCD_CR3_DEAD2       0x04
#define MASK_LCD_CR3_SOFC        0x08
#define MASK_LCD_CR3_SOF         0x10
#define MASK_LCD_CR3_SOFIE       0x20
#define MASK_LCD_CR3_LCDEN       0x40

#define MASK_LCD_FRQ_DIV0        0x01
#define MASK_LCD_FRQ_DIV1        0x02
#define MASK_LCD_FRQ_DIV2        0x04
#define MASK_LCD_FRQ_DIV3        0x08
#define MASK_LCD_FRQ_PS0         0x10
#define MASK_LCD_FRQ_PS1         0x20
#define MASK_LCD_FRQ_PS2         0x40
#define MASK_LCD_FRQ_PS3         0x80

#define MASK_LCD_PM0_SEG00       0x01
#define MASK_LCD_PM0_SEG01       0x02
#define MASK_LCD_PM0_SEG02       0x04
#define MASK_LCD_PM0_SEG03       0x08
#define MASK_LCD_PM0_SEG04       0x10
#define MASK_LCD_PM0_SEG05       0x20
#define MASK_LCD_PM0_SEG06       0x40
#define MASK_LCD_PM0_SEG07       0x80

#define MASK_LCD_PM1_SEG08       0x01
#define MASK_LCD_PM1_SEG09       0x02
#define MASK_LCD_PM1_SEG10       0x04
#define MASK_LCD_PM1_SEG11       0x08
#define MASK_LCD_PM1_SEG12       0x10
#define MASK_LCD_PM1_SEG13       0x20
#define MASK_LCD_PM1_SEG14       0x40
#define MASK_LCD_PM1_SEG15       0x80

#define MASK_LCD_PM2_SEG16       0x01
#define MASK_LCD_PM2_SEG17       0x02
#define MASK_LCD_PM2_SEG18       0x04
#define MASK_LCD_PM2_SEG19       0x08
#define MASK_LCD_PM2_SEG20       0x10
#define MASK_LCD_PM2_SEG21       0x20
#define MASK_LCD_PM2_SEG22       0x40
#define MASK_LCD_PM2_SEG23       0x80

#define MASK_LCD_PM3_SEG24       0x01
#define MASK_LCD_PM3_SEG25       0x02
#define MASK_LCD_PM3_SEG26       0x04
#define MASK_LCD_PM3_SEG27       0x08
#define MASK_LCD_PM3_SEG28       0x10
#define MASK_LCD_PM3_SEG29       0x20
#define MASK_LCD_PM3_SEG30       0x40
#define MASK_LCD_PM3_SEG31       0x80

#define MASK_LCD_PM4_SEG32       0x01
#define MASK_LCD_PM4_SEG33       0x02
#define MASK_LCD_PM4_SEG34       0x04
#define MASK_LCD_PM4_SEG35       0x08
#define MASK_LCD_PM4_SEG36       0x10
#define MASK_LCD_PM4_SEG37       0x20
#define MASK_LCD_PM4_SEG38       0x40
#define MASK_LCD_PM4_SEG39       0x80

